health.yml
config:
  target: "http://127.0.0.1:3000/graphql"
  phases:
    - duration: 10
      name: "Health"
      arrivalRate: 10

scenarios:
  - name: "Health"
    flow:
      - post:
          url: "/"
          json:
            query: |
              query getHealth {
                healthCheck
              }
            capture:
              json: "$.data.healthCheck"
              as: "healthCheck"